final_project/app/controllers/users_controller.rb

  def show
    @posts = Post.where(:user_id => @user.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "name", "surname", "nickname", "created_at", "updated_at", "password_hash", "avatar") VALUES (?, ?, ?, ?, ?, ?, ?, ?)